n5/src/InformationRegisters/BPRouter/BPRouter.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>BPRouter</name>
  <dimensions>
    <name>User</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Role</name>
    <type>
      <types>EnumRef.Roles</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Department</name>
    <type>
      <types>CatalogRef.Departments</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Activity</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

n5/src/InformationRegisters/InternalOrderResolutions/InternalOrderResolutions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>InternalOrderResolutions</name>
  <resources>
    <name>Memo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Document</name>
    <type>
      <types>DocumentRef.InternalOrder</types>
    </type>
  </dimensions>
  <dimensions>
    <name>User</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Date</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

n5/src/Enums/InternalOrderPoints/InternalOrderPoints.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>InternalOrderPoints</name>
  <enumValues>
    <name>All</name>
  </enumValues>
  <enumValues>
    <name>DepartmentHeadResolution</name>
  </enumValues>
  <enumValues>
    <name>Finish</name>
  </enumValues>
  <enumValues>
    <name>New</name>
  </enumValues>
  <enumValues>
    <name>Delivery</name>
  </enumValues>
  <enumValues>
    <name>Reject</name>
  </enumValues>
  <enumValues>
    <name>Rework</name>
  </enumValues>
</mdclass:Enum>

n5/src/Documents/InternalOrder/InternalOrder.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>InternalOrder</name>
  <posting>Deny</posting>
  <registerRecords>AccumulationRegister.Allocation</registerRecords>
  <registerRecords>AccumulationRegister.InternalOrders</registerRecords>
  <registerRecords>AccumulationRegister.Provision</registerRecords>
  <registerRecords>AccumulationRegister.Items</registerRecords>
  <registerRecords>AccumulationRegister.Reserves</registerRecords>
  <attributes>
    <name>Action</name>
    <type>
      <types>EnumRef.Actions</types>
    </type>
  </attributes>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>DeliveryDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Department</name>
    <type>
      <types>CatalogRef.Departments</types>
    </type>
  </attributes>
  <attributes>
    <name>Factor</name>
    <type>
      <types>DefinedType.Factor</types>
    </type>
  </attributes>
  <attributes>
    <name>GrossAmount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Performer</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Prices</name>
    <type>
      <types>CatalogRef.Prices</types>
    </type>
  </attributes>
  <attributes>
    <name>Process</name>
    <type>
      <types>BusinessProcessRef.InternalOrder</types>
    </type>
  </attributes>
  <attributes>
    <name>Rate</name>
    <type>
      <types>DefinedType.Rate</types>
    </type>
  </attributes>
  <attributes>
    <name>Resolution</name>
    <type>
      <types>EnumRef.Resolutions</types>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Tax</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Taxable</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxableAmount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxCode</name>
    <type>
      <types>CatalogRef.TaxCodes</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxGroup</name>
    <type>
      <types>CatalogRef.TaxGroups</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxRate</name>
    <type>
      <types>DefinedType.TaxRate</types>
    </type>
  </attributes>
  <attributes>
    <name>VAT</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>VATUse</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Warehouse</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Changes</name>
    <attributes>
      <name>Date</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Information</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>400</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Reason</name>
      <type>
        <types>EnumRef.ChangeReasons</types>
      </type>
    </attributes>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.Users</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Capacity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>DeliveryDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DocumentOrder</name>
      <type>
        <types>DocumentRef.ProductionOrder</types>
        <types>DocumentRef.PurchaseOrder</types>
      </type>
    </attributes>
    <attributes>
      <name>DocumentOrderRowKey</name>
      <type>
        <types>CatalogRef.RowKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Package</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
    <attributes>
      <name>Prices</name>
      <type>
        <types>CatalogRef.Prices</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkg</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Reservation</name>
      <type>
        <types>EnumRef.Reservation</types>
      </type>
    </attributes>
    <attributes>
      <name>RowKey</name>
      <type>
        <types>CatalogRef.RowKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Series</name>
      <type>
        <types>CatalogRef.Series</types>
      </type>
    </attributes>
    <attributes>
      <name>Stock</name>
      <type>
        <types>CatalogRef.Warehouses</types>
      </type>
    </attributes>
    <attributes>
      <name>Taxable</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>TaxableAmount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>TaxCode</name>
      <type>
        <types>CatalogRef.TaxCodes</types>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VAT</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VATCode</name>
      <type>
        <types>CatalogRef.VAT</types>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Services</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>DeliveryDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Department</name>
      <type>
        <types>CatalogRef.Departments</types>
      </type>
    </attributes>
    <attributes>
      <name>Description</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Performer</name>
      <type>
        <types>EnumRef.Performers</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
    <attributes>
      <name>Prices</name>
      <type>
        <types>CatalogRef.Prices</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>RowKey</name>
      <type>
        <types>CatalogRef.RowKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Taxable</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>TaxableAmount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>TaxCode</name>
      <type>
        <types>CatalogRef.TaxCodes</types>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VAT</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VATCode</name>
      <type>
        <types>CatalogRef.VAT</types>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Taxes</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Percent</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
    <attributes>
      <name>Tax</name>
      <type>
        <types>CatalogRef.TaxItems</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

n5/src/CommonModules/InternalOrderMailing/Module.bsl
Procedure Send ( Params ) export

	SetPrivilegedMode ( true );
	env = initEnv ();
	getData ( Params, env );
	profile = MailboxesSrv.SystemProfile ();
	table = Env.Receivers;
	for each row in table do
		message = getMessage ( Params, Env, row );
		try
			MailboxesSrv.Post ( profile, message );
		except
			WriteLogEvent ( "MailboxesSrv.Post", EventLogLevel.Error, Metadata.CommonModules.InternalOrderMailing, Params.Ref, ErrorDescription () );
		endtry
	enddo; 
	SetPrivilegedMode ( false );
	
EndProcedure 

Function initEnv ()
	
	env = new Structure ();
	SQL.Init ( env );
	return env;
	
EndFunction

Procedure getData ( Params, Env )
	
	sqlFields ( Env );
	sqlItems ( Env );
	sqlReceivers ( Params, Env );
	Env.Q.SetParameter ( "Ref", Params.Ref );
	Env.Q.SetParameter ( "Process", Params.Process );
	Env.Q.SetParameter ( "Sender", Params.Sender );
	Env.Q.SetParameter ( "Noreply", Cloud.Noreply () );
	Env.Q.SetParameter ( "EmptyMemo", Output.EmptyMemo () );
	SQL.Perform ( Env );

EndProcedure 

Procedure sqlFields ( Env )
	
	s = "
	|// @Fields
	|select Document.Company as Company, Document.Number as Number, Document.Department.Description as Department,
	|	Document.Creator.Description as Responsible, Document.Amount as Amount,
	|	Document.Currency.Description as Currency, Document.Creator.Email as CreatorEmail,
	|	Document.Creator.Description as Creator, Senders.Email as SenderEmail, Senders.Description as Sender
	|from Document.InternalOrder as Document
	|	//
	|	// Senders
	|	//
	|	join Catalog.Users as Senders
	|	on Senders.Ref = &Sender
	|where Document.Ref = &Ref
	|";
	Env.Selection.Add ( s );
	
EndProcedure

Procedure sqlItems ( Env )
	
	s = "
	|// #Items
	|select Items.LineNumber as LineNumber, Items.Item.Description as Item,
	|	Items.Package.Description as Package, Items.QuantityPkg as Quantity,
	|	Items.Price as Price, Items.Amount as Amount
	|from Document.InternalOrder.Items as Items
	|where Items.Ref = &Ref
	|;
	|// #Services
	|select Services.LineNumber as LineNumber, Services.Description as Item,
	|	Services.Item.Unit.Code as Package, Services.Quantity as Quantity,
	|	Services.Price as Price, Services.Amount as Amount
	|from Document.InternalOrder.Services as Services
	|where Services.Ref = &Ref
	|";
	Env.Selection.Add ( s );	
	
EndProcedure

Procedure sqlReceivers ( Params, Env )
	
	s = "
	|// #Receivers
	|select Receivers.User as User, Receivers.RoutePoint as RoutePoint, Receivers.Email as Email, isnull ( Memos.Memo, &EmptyMemo ) as Memo
	|from (
	|	select Tasks.User as User, Tasks.RoutePoint as RoutePoint, Tasks.User.Email as Email
	|	from Task.Task as Tasks
	|	where not Tasks.Executed
	|	and not Tasks.DeletionMark
	|	and Tasks.BusinessProcess = &Process
	|	and Tasks.User <> value ( Catalog.Users.EmptyRef )
	|	and Tasks.User.Email <> """"
	|	union
	|	select BPRouter.User, Tasks.RoutePoint, BPRouter.User.Email
	|	from Task.Task as Tasks
	|		//
	|		// BPRouter
	|		//
	|		join InformationRegister.BPRouter as BPRouter
	|		on BPRouter.Activity
	|		and BPRouter.Role = Tasks.Role
	|		and BPRouter.Department = Tasks.Department
	|		and Tasks.RoutePoint = value ( BusinessProcess.InternalOrder.RoutePoint.DepartmentHeadResolution )
	|		and BPRouter.User.Email <> """"
	|	where not Tasks.Executed
	|	and not Tasks.DeletionMark
	|	and Tasks.BusinessProcess = &Process
	|	and Tasks.User = value ( Catalog.Users.EmptyRef )
	|	) as Receivers
	|	//
	|	// Memo
	|	//
	|	left join (
	|		select top 1 Memos.Memo as Memo, Memos.User as User
	|		from InformationRegister.InternalOrderResolutions as Memos
	|		where Memos.Document = &Ref
	|		order by Memos.Date desc
	|	) as Memos
	|	on Memos.User = &Sender
	|where Receivers.RoutePoint in ( value ( BusinessProcess.InternalOrder.RoutePoint.DepartmentHeadResolution ),
	|	value ( BusinessProcess.InternalOrder.RoutePoint.Reject ),
	|	value ( BusinessProcess.InternalOrder.RoutePoint.Rework ),
	|	value ( BusinessProcess.InternalOrder.RoutePoint.Delivery )
	|	)
	|";
	Env.Selection.Add ( s );
	
EndProcedure 

Function getMessage ( Params, Env, Receiver )
	
	message = new InternetMailMessage ();
	message.To.Add ( Receiver.Email );
	fillMessage ( Params, Env, Receiver, message );
	return message;
	
EndFunction 

Procedure fillMessage ( Params, Env, Receiver, Message )
	
	routePoint = Receiver.RoutePoint;
	lastRoutePoint = Params.LastRoutePoint;
	parts = new Structure ();
	parts.Insert ( "InternalOrderURL", Conversion.ObjectToURL ( Params.Ref ) );
	parts.Insert ( "Department", Env.Fields.Department );
	parts.Insert ( "Number", Env.Fields.Number );
	parts.Insert ( "Sender", Env.Fields.Sender );
	parts.Insert ( "Creator", Env.Fields.Creator );
	parts.Insert ( "Responsible", Env.Fields.Responsible );
	parts.Insert ( "Memo", Receiver.Memo );
	parts.Insert ( "Amount", Conversion.NumberToMoney ( Env.Fields.Amount, Env.Fields.Currency ) );
	parts.Insert ( "RoutePoint", routePoint );
	parts.Insert ( "Items", getItems ( Env, "Items", Receiver ) );
	parts.Insert ( "Services", getItems ( Env, "Services", Receiver ) );
	routePoints = BusinessProcesses.InternalOrder.RoutePoints;
	if ( rework ( routePoint, lastRoutePoint ) ) then
		Message.Subject = Output.ReworkSubject ( parts );
		Message.Texts.Add ( Output.ReworkBody ( parts ) );
		Message.From = Env.Fields.SenderEmail;
	elsif ( routePoint = routePoints.Reject ) then
		Message.Subject = Output.RejectSubject ( parts );
		Message.Texts.Add ( Output.RejectBody ( parts ) );
		Message.From = Env.Fields.SenderEmail;
	elsif ( routePoint = routePoints.DepartmentHeadResolution
		or routePoint = routePoints.Delivery ) then
		if ( lastRoutePoint = Enums.InternalOrderPoints.Rework ) then
			Message.Subject = Output.AgainApprovalSubject ( parts );
			Message.Texts.Add ( Output.AgainApprovalBody ( parts ) );
		else
			if ( lastRoutePoint = Enums.InternalOrderPoints.New ) then
				parts.Insert ( "Performer", "" );
			else
				parts.Insert ( "Performer", Output.PreviousPerformer ( new Structure ( "Performer", Env.Fields.Sender ) ) );
			endif; 
			Message.Subject = Output.ApprovalSubject ( parts );
			Message.Texts.Add ( Output.ApprovalBody ( parts ) );
		endif; 
		Message.From = Env.Fields.CreatorEmail;
	endif; 
	
EndProcedure 

Function rework ( RoutePoint, LastRoutePoint )
	
	routePoints = BusinessProcesses.InternalOrder.RoutePoints;
	return RoutePoint = routePoints.Rework;
		
EndFunction 

Function getItems ( Env, TableName, Receiver )
	
	table = Env [ TableName ];
	if ( table.Count () = 0 ) then
		return "";
	endif; 
	items = new Array ();
	items.Add ( Metadata.Documents.InternalOrder.TabularSections [ TableName ].Presentation () + ":" );
	p = new Structure ( "LineNumber, Item, Quantity, Price, Amount, Comment" );
	currency = Env.Fields.Currency;
	for each row in table do
		p.LineNumber = row.LineNumber;
		p.Item = row.Item;
		p.Quantity = Conversion.NumberToQuantity ( row.Quantity, row.Package );
		p.Price = Conversion.NumberToMoney ( row.Price, currency );
		p.Amount = Conversion.NumberToMoney ( row.Amount, currency );
		items.Add ( Output.ItemsRow ( p ) );
	enddo; 
	return Chars.LF + StrConcat ( items, Chars.LF );
	
EndFunction
